# Итоговое задание по модулю «Интеграция систем и документирование API»

Кинотеатр “Искорка”, для которого мы ранее разработали многофункциональный API, планирует запустить бонусную программу для постоянных посетителей.

## Условия заказчика:

* Участие в бонусной программе необязательно, при желании посетитель может оформить бонусную карту.
* Если клиент указывает при бронировании номер карты, то 10% стоимости бронирования зачисляется на карту в виде бонусных баллов (1 балл = 1 рубль).
* Баллы начисляются автоматически сразу после оплаты брони.
* При бронировании клиент может оплачивать до 50% стоимости билетов бонусными баллами.
* Также руководство кинотеатра ставит задачу - представлять ежемесячный отчет:
- как часто клиенты используют бонусную карту при бронировании
- какую часть стоимости билетов (%) клиенты оплачивают бонусными баллами

## Решение
### Какие изменения потребуется внести в существующие структуры данных для решения задачи?
1. Потребуется расширить существующую таблицу *Пользователи / Customers*
